service/src/test/resources/dummyPayment.json

{
  "offset": 0,
  "count": 1,
  "total": 1,
  "results": [
    {
      "id": "40a495a2-d709-4484-88cb-d4129acffda7",
      "version": 1,
      "amountPlanned": {
        "currencyCode": "EUR",
        "centAmount": 20000
      },
      "paymentMethodInfo": {},
      "paymentStatus": {},
      "transactions": [
        {
          "id": "58728a39-c2f5-4467-ab17-b329b55c4423",
          "timestamp": "2015-12-03T10:00:31.498Z",
          "type": "Charge",
          "amount": {
            "currencyCode": "EUR",
            "centAmount": 20000
          },
          "interactionId": "1",
          "state": "Success"
        }
      ],
      "interfaceInteractions": [],
      "createdAt": "2015-12-03T10:00:31.498Z",
      "lastModifiedAt": "2015-12-03T10:00:31.498Z",
      "lastMessageSequenceNumber": 1
    }
  ]
}